Tekla Open API Reference for Tekla Structures 2025
BoltGroup.AddOtherPartToBolt Method
 Adds the given part to the list of the other parts that should be bolted.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool AddOtherPartToBolt(
	Part M
)
Public Function AddOtherPartToBolt (
	M As Part
) As Boolean
Parameters
M
Type: Tekla.Structures.Model.Part
The part to add.
Return Value
Type: Boolean
True on success.
See Also
Reference
BoltGroup Class
Tekla.Structures.Model Namespace